class MessagesText:
    WELCOME = ("Привіт, я КТГГ-бот. Прочитай правила користування ботом. "
               "Попереджую, у разі порушення правил є можливість автоматичного додання до чорного списку. "
               "Обери дію, щоб продовжити роботу")

    MENU_MESSAGES = "Обери потрібну дію, не забувай, що неправильне використання може тебе заблокувати"

    ADDED_ACCOUNT_IN_DB = "Твої дані занесено до бази даних"

    MAIN_RULES = (
        "Основні правила користувача: \n"
        "1. Спам\n"
        "    1.1. Спамом вважається надсилання більше 2 повідомлень адміністратору однакового змісту.\n"
        "    1.2. За спам користувач додається до чорного списку.\n"
        "    1.3. Також спамом вважається часте натискання пунктів меню (частіше ніж раз в 1 секунду)\n"
        "2. Скидання пароля через фото студентського квитка\n"
        "    2.1. Надсилати фото студентського квитка зі сторони, де розташоване фото\n"
        "    2.2. Не надсилати інших фото\n"
        "    2.3. Скріни з додатку \'Дія\' не приймаються\n"
        "    2.4. Бот не зберігає фото довше, ніж на час обробки запиту\n"
        "3. Ідентичність даних користувача\n"
        "    3.1. Дані на платформі MS Teams повинні бути ідентичними до даних в документах\n"
        "4. Чорний список\n"
        "    4.1. Більшу частину модерації виконує бот, тому можливо, що користувач потрапить в чорний список випадково\n"
        "    4.2. У випадку потрапляння в чорний список, зверніться до адміністратора, для з\'ясування обставин\n"
        "5. Список правил може змінюватися після кожного оновлення бота"
    )

    MAIN_FAQ = (
        "1. Teams\n"
        "    1.1. Я на можу зайти в Teams, моя пошта ...@gmail.com (ukr.net,...)\n"
        "         Кожному створено обліковий запис типу ...@kdktgg.onmicrosoft.com або ...@ktgg.kiev.ua, "
        "тільки під цим записом можна користуватися MS Teams\n"
        "    1.2. Пароль невірний, я ввожу той, що мені дав куратор\n"
        "         При першому вході (або після зміни пароля) в свій акаунт ВСІ змінюють пароль на будь-який свій, "
        "тому при подальшому вході потрібно використовувати саме його\n"
        "    1.3. Я не бачу груп у себе\n"
        "         Уважно перевірте чи зайши ви під акаунтом, що вам надали, якщо ні, то перезайдіть, "
        "так - зверніться до адміністратора\n"
        "    1.4. Я не бачу занять у календарі\n"
        "         Уважно перевірте чи зайши ви під акаунтом, що вам надали, якщо ні, то перезайдіть, "
        "якщо вас додали пізніше, то заняття створені раніше в календарі не відображаються, підключатися до них можна "
        "через \'Команди\'\n"
        "    1.5. У мене залишився розклад минулого року\n"
        "         Ви можете його видалити через \'Календар\'\n"
        "    1.6. У мене немає логіна\n"
        "         Зверніться до куратора за логіном, у випадку відсутності у куратора зверніться до адміністратора\n"
        "    1.7. Я втратив логін та пароль\n"
        "         Можете скинути пароль і отримати логін, у випадку відсутності документів, зверніться до адміністраторів\n"
        "2. Bot Tasks\n"
        # TODO: Write
        "3. Oftop"
        # TODO: Write links
    )

    RESET_PASSWORD_WITHOUT_ACC_CHOICE_VERIFY_TYPE = (
        "Для зміни пароля, потрібно дізнатися твої дані будь ласка, обери тип верифікації")

    MESSAGE_TO_ADMIN = ("Напиши своє повідомлення та надішли його, бот постарається якнайшвидше передати його "
                        "адміністраторам. Зауваж, що використовувати нецензурну лексику в повідомленні заборонено, "
                        "в такому випадку акаунт може бути доданий до чорного списку. "
                        "Якщо випадково перейшов(ла) сюди, відміни дію.\n*На деяку частину повідомлень може відповідати "
                        "бот, але повідомлення в будь-якому разі отримають адміністратори")

    MESSAGE_TO_ADMIN_NO_TEAMS = (
        "Напиши своє повідомлення та надішли його, бот постарається якнайшвидше передати його "
        "адміністраторам. Зауваж, що використовувати нецензурну лексику в повідомленні заборонено, "
        "в такому випадку акаунт може бути доданий до чорного списку. "
        "Повідомлення цього типу відсилаються з більшою пріоритетністю."
        "Якщо випадково перейшов(ла) сюди, відміни дію.\n*На деяку частину повідомлень може відповідати "
        "бот, але повідомлення в будь-якому разі отримають адміністратори")

    MESSAGE_STUDENT_TICKET_RESET_TYPE = (
        "Ти обрав(ла) тип верифікації за допомогою студентького квитка. "
        "Надішли фото студентського квитка зі сторони, де знаходиться фото та штрихкод. "
        "Зауваж, що скріни з додатку \'Дія\' не є типом верифікації, бот в такому випадку буде видавати помилку"
    )

    MESSAGE_ID_CARD_RESET_TYPE = (
        "Ти обрав(ла) тип верифікації за допомогою id-картки. Надішли, будь ласка, свої дані в такому форматі:\n"
        "<Прізвище> <Ім\'я> <По батькові> <останні 4 цифри номера id-картки>\n"
        "Наприклад: Січко Роман Вікторович 0000. Зверни увагу на те, що такий спосіб верифікації можливий, "
        "якщо в тебе паспорт у формі картки"
    )

    MESSAGE_EDIT_EMAIL_ACCOUNT = (
        "Хочеш змінити свою електронну пошту? Без проблем, напиши, будь ласка, нову та відправ повідомлення, "
        "через деякий час твоя пошта зміниться. Не забувай, що потрібно підтвердити цю дію кодом з листа\n"
        "P.S. Якщо що, то там є кнопочка Відмінити"
    )

    MESSAGE_EDIT_TEAMS_ACCOUNT = (
        "Хочеш змінити акаунт MS Teams? Напиши, будь ласка, новий та відправ повідомлення, "
        "через деякий час твій MS Teams зміниться. Не забувай, що потрібно підтвердити цю дію кодом з листа\n"
        "P.S. Якщо що, то там є кнопочка Відмінити"
    )

    MESSAGE_ADD_EMAIL_ACCOUNT = (
        "Хочеш додати свою електронну пошту? Напиши, будь ласка, нову та відправ повідомлення, "
        "через деякий час твоя пошта зміниться. Не забувай, що потрібно підтвердити цю дію кодом з листа\n"
        "P.S. Якщо що, то там є кнопочка Відмінити"
    )

    MESSAGE_ADD_TEAMS_ACCOUNT = (
        "Хочеш додати акаунт MS Teams? Напиши, будь ласка, новий та відправ повідомлення, "
        "через деякий час твій MS Teams зміниться. Не забувай, що потрібно підтвердити цю дію кодом з листа\n"
        "P.S. Якщо що, то там є кнопочка Відмінити"
    )

    MESSAGE_RESET_PASSWORD_ACCOUNT = (
        "Твій пароль буде змінено найближчим часом і надішлеться в наступному повідомленні. Відмінити цю дію неможливо."
        "Пс... У нас тут є пасхалка, можна мемчики ввімкнути, а як, то вже секрет, але спробуй щось <memeees>"
    )

    MESSAGE_EDIT_DATA_ACCOUNT = (
        "Хочеш змінити свої дані? Без проблем, напиши, будь ласка, нові дані та відправ повідомлення, "
        "через деякий час вони зміниться.\nP.S.Якщо що, то там є кнопочка Відмінити"
    )

    MESSAGE_WAIT_ACTION = "Зачекай деякий час, я здійснюю перевірку даних"

    NEW_PASSWORD = ("🥳🥳🥳\nВаш логін: {login}\nВаш тимчасовий пароль: {password}\n"
                    "При вході змінюєте пароль на свій, який в подальшому буде використовуватися для входу")

    STUDENT_TICKET_NOT_FOUND = (
        "Дивно, але я не зміг найти твої дані, спробуй ще раз відправити більш якісне фото, "
        "або зміни тип верифікації"
    )

    NOT_CONFIRMED_ACTION = "Оу, ти не можеш виконати зараз цю дію, спробуй іншу"

    ADMIN_PANEL = (
        "Оооо, дааа... Хіба це не рай? Роби все що хочеш. Хоча ні, було б дуже просто... Тепер твої"
        " права визначаю я 😈. Можеш тицяти на кнопки, але якщо немає прав, то така твоя доля")

    ADMIN_PANEL_DENIED = (
        "Ні ні ні... Так справа не піде, не твоя територія, не твої правила. "
        "Хоча, якщо ти все ж таки адмін, то додай собі права, це ти можеш."
    )

    ADMIN_PANEL_WITHOUT_RIGHTS = (
        "Хммм, хтось забув тобі дати права сюди, можеш піти попихати їх, "
        "або сам додай його"
    )

    ADMIN_PANEL_RESET_PASSWORD_BY_ID = (
        "Ну і хто той нещасний, пиши його айдішку (...@ktgg.kiev.ua, ...@kdktgg.onmicrosoft.com)"
    )

    ADMIN_PANEL_RESET_PASSWORD_BY_PIB = (
        "Ну і хто той нещасний, пиши його ім'я та прізвище (спочатку ім'я)"
    )

    MESSAGE_TO_ADMIN_SENDED = "Повідомлення надіслано адміністратору, чекай на відповідь"

    RESETED_PASSWORD = ("Твої облікові дані \nЛогін: {login}\nПароль: {password}\n "
                        "Нікому не передавай їх, бо це є прямим доступом до акаунту")

    FAIL_TO_RESET_PASSWORD = ("Дивно, я не зміг знайти твоїх облікових даних, "
                              "перевір правильність введення та спробуй ще раз, або відміни дію")

    ADMIN_RESET_BY_ID_WRONG_MAIL = "Якась крива пошта, спробуй ще раз"

    ADMIN_MESSAGE_SENT = "Повідомлення надіслано"

    ADMIN_MESSAGE_ANSWER = "Відповідь адміністратора:\n {answer}"

    ADMIN_MESSAGE_ANSWERED = "На це повідомлення вже хтось відповів"


class ConstantMessages_old:
    START_MESSAGE = ("Привіт, я КТГГ-бот, допоможу Вам в роботі з MS Teams.\n"
                     "Оберіть потрібний пункт меню для продовження роботи")

    NEXT_ACTION = "Оберіть подальшу дію"

    ACCOUNT_DATA_TO_DB = "Ваші дані занесено до бази, перегляньте та допоповніть їх"

    WAIT_DATA_CHECK = "Зачекайте деякий час. Перевіряю ваші дані"

    DATA_FOUND = "Дані знайдено. Генерую тимчасовий пароль"



    PHOTO_DATA_NOT_FOUND = "Вибачте, ваші дані в базі не знайдено, спробуйте відправити інше фото"

    UNKWOWN_ACTION = "Невідома дія"

    ENTER_PASSWORD = "Введіть пароль"

    ACTION = "Оберіть дію"

    ADMIN_STATUSES = "Оберіть один із статусів\n🔴 - зайнятий\n🟠 - не активний\n🟡 - на парі\n🟢 - вільний"

    TICKET_PHOTO = "Відправте фото ДІЙСНОГО студентського квитка для отримання тимчасового пароля"

    CARD_DATA = ("Для верифікації через ID картку, відправте ПІБ та останні чотири цифри номера паспорта \n "
                 "Повідомлення повинно бути типу: Шевченко Тарас Григорович 0000.")

    RULES = ("Основні правила користуваня:\n1. Не спамити боту, у випадку спаму ваш акаунт буде заблокований.\n"
             "2. Надсилати лише фото студентського квитка. Надсилати фото можна з будь якого ракурсу, головне,"
             "щоб фото мало достатнє освітлення \n 3. Фото студентського квитка з додатку Дія не приймаються, "
             "бот буде видавати помилку \n 4. Обовязковою умовою скидання пароля є ідентичність ПІБ в документі та "
             "MS Teams, у випадку, якщо ПІБ не співпадає, зверніться до адміністратора для зміни ПІБ")

    FAQ = ("1. Я не можу зайти, моя пошта ...@gmail.com (ukr.net,...)\n"
           "Відповідь: кожному студенту створено обліковий запис типу ...@kdktgg.onmicrosoft.com або ...@ktgg.kiev.ua, "
           "тільки під цим записом ви можете користуватися MS Teams\n2. Пароль невірний, я ввожу той, що мені "
           "дав куратор\nВідповідь: при першому вході в свій акаунт ВСІ змінюють пароль на будь-який свій, тому при "
           "подальшому вході потрібно використовувати саме його\n3. Я не бачу груп у себе\nВідповідь: уважно перевірте "
           "чи зайши ви під акаунтом, що вам надали, якщо ні, то перезайдіть, так - зверніться до адміністратора\n"
           "4. Я не бачу занять у календарі\nВідповідь: уважно перевірте чи зайши ви під акаунтом, що вам надали, "
           "якщо ні, то перезайдіть, якщо вас додали пізніше, то заняття створені раніше в календарі не "
           "відображаються, підключатися до них можна через \'Команди\'\n5. У мене залишився розклад минулого року\n"
           "Відповідь: ви можете його видалити через \'Календар\'\n6. У мене немає логіна\nВідповідь: зверніться до "
           "куратора за логіном, у випадку відсутності у куратора зверніться до адміністратора\n7. Я втратив логін та "
           "пароль\nВідповідь: можете скинути пароль і отримати логін, у випадку відсутності документів, "
           "зверніться до адміністраторів")

    VERIFICATION_TYPE = "Оберіть тип верифікації:"

    SEND_MESSAGE_CANCEL = "Відправте повідомлення або відмініть дію"

    SEND_EMAIL_CANCEL = "Відправте адресу Вашої електронної пошти або відмініть дію"

    SEND_EMAIL_TEAMS_CANCEL = "Відправте логін (...@ktgg.kiev.ua або ...@kdktgg.onmicrosoft.com) або відмініть дію"

    SEND_LASTNAME_CANCEL = "Відправте Ваше прізвище"

    SEND_NAME_CANCEL = "Відправте Ваше ім\'я"

    TEACHER_ID = ("Для верифікації відправте особовий ID та прізвище, ім\'я, по батькові. "
                  "Наприклад: 123456 Антонов Антон Антонович")

    ADMIN_QUIT = "Ви покинули адмін панель. Щоб знову зайти напишіть команду"

    NO_IN_ADMIN = "Ви не були в адмін панелі"

    NO_VERIFY = "Не верифіковано"

    CANCEL = "Відмінити"

    FINISH = "Завершити"

    FINISH_CALL = "Завершити розмову"

    STATUS_CHANGE = "Ваш статус змінено"

    CARD_DATA_NOT_FOUND = ("Вибачте, ваші дані в базі не знайдено, "
                           "перевірте правильність введення даних та відправте ще раз")

    NOT_FOUND_WITHOUT_ACC = ("Вибачте, ваші дані в базі не знайдено, впевніться, "
                             "що ви маєте акаунт в MS Teams або зверніться до адміністратора")

    INVALID_DATA = "Невірно введені дані"

    MESSAGE_SENT_ADMIN = "Повідомлення надіслано адміністратору"

    SUCCESS_VERIFY = "Верифікація успішна"

    BAD_VERIFY = "Невірний пароль, верифікацію відмінено"

    MESSAGE_MARK = "Повідомлення відмічено"

    MESSAGE_FROM_ADMIN = "Відповідь адміністратора: \n{answer}"

    MESSAGE_SENT = "Повідомлення надіслано"

    ALREADY_ANSWERED = "На повідомлення уже відповіли"

    SUCCESS_DELETE = "Користувач: {user}\nid: {id}\nУспішно видалений"

    FAIL_DELETE = "Помилка видалення: {lastname} {name}"

    CALL_ADMIN = "Оберіть адміністратора та зателефонуйте йому в Telegram"

    MAIL_CONFIRM_CODE = ("На Вашу електронну пошту надісланий код підтвердження (можливо воно потрапило в спам), "
                         "надішліть його боту")

    INVALID_MAIL = "Ви ввели неіснуючу електронну пошту, надішліть правильну адресу або відмініть дію"

    MAIL_CONFIRMED = "Вашу електронну пошту підтвердженно, перегляньте Ваш акаунт"

    INVALID_CONFIRM_CODE = "Введений код невірний, спробуйте ще раз або відмініть дію"

    TEAMS_CONFIRM_CODE = ("Перейдіть за посиланням https://outlook.office.com/mail/inbox (якщо Вас просить увійти, "
                          "вводьте дані від MS Teams), у листі від no-reply@ktgg.kiev.ua вказаний код, відправте "
                          "його боту\nЯкщо виникли проблеми, можете звернутися до адміністратора @Roma_Sichko")

    INVALID_TEAMS = ("Не вдалося знайти ваш обліковий запис, перевірте правильність введення даних і "
                     "відправте ще раз або відмініть дію")

    UNREAL_MAIL = "Ви ввели неіснуючу електронну пошту, надішліть правильну адресу або відмініть дію"

    CONFIRMED_ACCOUNT = "Ваш обліковий запіс підтверджено, Вам доступні нові дії в акаунті"

    CHANGE_ACCOUNT_DATA = "Ваші дані змінено, перегляньте свій акаунт"
